In [2]:
import pandas as pd
print("the pandas version is :",pd.__version__)

the pandas version is : 2.3.0

In [3]:
data=[10,20,30,40,50]
df=pd.Series(data,index=['A','B','C','D','E'])
print(df)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [4]:
dict1={
    "name":['Yash','Prajwal','Harshal'],
    "age" : [21,22,21],
    "salary":[10000,15000,20000]
}

In [5]:
df=pd.DataFrame(dict1)
df

      name  age  salary
0     Yash   21   10000
1  Prajwal   22   15000
2  Harshal   21   20000

In [6]:
df.head()

      name  age  salary
0     Yash   21   10000
1  Prajwal   22   15000
2  Harshal   21   20000

In [10]:
df.tail(1)

      name  age  salary
2  Harshal   21   20000

In [7]:
df.shape

(3, 3)

In [8]:
df.columns

Index(['name', 'age', 'salary'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [10]:
df.describe()

             age   salary
count   3.000000      3.0
mean   21.333333  15000.0
std     0.577350   5000.0
min    21.000000  10000.0
25%    21.000000  12500.0
50%    21.000000  15000.0
75%    21.500000  17500.0
max    22.000000  20000.0

In [11]:
df['name']

0       Yash
1    Prajwal
2    Harshal
Name: name, dtype: object

In [12]:
df[['name','age']]

      name  age
0     Yash   21
1  Prajwal   22
2  Harshal   21

In [14]:
df.iloc[0]#first row

name       Yash
age          21
salary    10000
Name: 0, dtype: object

In [23]:
df.iloc[1:3]

      name  age  salary
1  Prajwal   22   15000
2  Harshal   21   20000

In [26]:
df.loc[0:2][['name','salary']] #or df.loc[0:2,['name','salary']]

      name  salary
0     Yash   10000
1  Prajwal   15000
2  Harshal   20000

In [28]:
df['tax']=df['salary']*0.10
df.head()

      name  age  salary     tax
0     Yash   21   10000  1000.0
1  Prajwal   22   15000  1500.0
2  Harshal   21   20000  2000.0

In [29]:
#updating the existing one
df['salary']=df['salary']+5000
df.head()

      name  age  salary     tax
0     Yash   21   15000  1000.0
1  Prajwal   22   20000  1500.0
2  Harshal   21   25000  2000.0

In [30]:
#deleting the column
df.drop('tax',axis=1,inplace=True)
df

      name  age  salary
0     Yash   21   15000
1  Prajwal   22   20000
2  Harshal   21   25000

In [53]:
df['bonus']=df['salary']*0.05
df

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.5   25000  1250.0          1.0

In [54]:
df.loc[2,'age']=None
df

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal   NaN   25000  1250.0          1.0

In [55]:
df.isnull()

    name    age  salary  bonus  salary_rank
0  False  False   False  False        False
1  False  False   False  False        False
2  False   True   False  False        False

In [56]:
df['age']=df['age'].fillna(df['age'].mode()[0])
df

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.0   25000  1250.0          1.0

In [57]:
df[(df['age']>21) & (df['salary']>1000)]

      name   age  salary   bonus  salary_rank
1  Prajwal  22.0   20000  1000.0          2.0

In [58]:
df.sort_values(by='salary',ascending=True)

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.0   25000  1250.0          1.0

In [59]:
df.sort_values(by=['salary','age'],ascending=[True,False])

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.0   25000  1250.0          1.0

In [60]:
df.sort_values(by=['salary','age'],ascending=[False,True])

      name   age  salary   bonus  salary_rank
2  Harshal  21.0   25000  1250.0          1.0
1  Prajwal  22.0   20000  1000.0          2.0
0     Yash  21.0   15000   750.0          3.0

In [61]:
df['salary_rank']=df['salary'].rank(ascending=False)
df

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.0   25000  1250.0          1.0

In [64]:
#group by
group_data=df.groupby('age')['salary'].mean()
group_data

age
21.0    20000.0
22.0    20000.0
Name: salary, dtype: float64

In [67]:
agg_data=df.groupby('age').agg({'salary':['min','max','mean']})
agg_data

     salary
        min    max     mean
age
21.0  15000  25000  20000.0
22.0  20000  20000  20000.0

In [68]:
df1=df.head(2)
df2=df.tail(1)
df3=pd.concat([df1,df2])
df3

      name   age  salary   bonus  salary_rank
0     Yash  21.0   15000   750.0          3.0
1  Prajwal  22.0   20000  1000.0          2.0
2  Harshal  21.0   25000  1250.0          1.0

In [76]:
dept=pd.DataFrame({
    "name":['Yash','Prajwal','Harshal'],
    "dept":["hr","DS","AI"]
})

In [77]:
merged_df=pd.merge(df,dept,on='name')
merged_df

      name   age  salary   bonus  salary_rank dept
0     Yash  21.0   15000   750.0          3.0   hr
1  Prajwal  22.0   20000  1000.0          2.0   DS
2  Harshal  21.0   25000  1250.0          1.0   AI

In [80]:
print("max salary:",df['salary'].max())
print("minimum salary",df['salary'].min())
print("avg of age",df['age'].mean())
print("std of age",df['age'].std())

max salary: 25000
minimum salary 15000
avg of age 21.333333333333332
std of age 0.5773502691896258

In [84]:
df['joining date']=pd.date_range(start='2020-11-01',periods=len(df),freq='ME')
df['joining year']=df['joining date'].dt.year 
print(df)

      name   age  salary   bonus  salary_rank joining date  joining year
0     Yash  21.0   15000   750.0          3.0   2020-11-30          2020
1  Prajwal  22.0   20000  1000.0          2.0   2020-12-31          2020
2  Harshal  21.0   25000  1250.0          1.0   2021-01-31          2021

In [ ]:
df.to_csv("saved_csv.csv",index=False)
print("doned")

doned

In [88]:
import os
path=os.getcwd()

In [89]:
path

'c:\\Users\\Lenovo\\OneDrive\\Desktop\\practice\\lecture\\pandas'